from enum import Enum


class KπX_BOLD(str, Enum):
    """KπX BOLD family in solid Unicode block elements."""

    # 6 lines
    S6 = """\
██▌   ▗▟█▛▘               ▝██▖   ▟█▛▘
██▌ ▗▟█▛▘   ▄▄▄▄▄▄▄▄▄▄▄▄▖   ▜█▙ ▟█▛
██▙▟██▘     ▝ ▐██   ██▌      ▜███▀
██▛▀▀██▖      ▐██   ██▌     ▗▟█▜█▙
██▌  ▝▜█▙     ▐█▛   ██▌    ▗██▘ ▀██▖
██▌    ▀██▄   ██▌   ▜██▟  ▄█▛▘   ▝██▖"""

    S6_LABS = """\
██▌   ▗▟█▛▘    KπX-Labs   ▝██▖   ▟█▛▘
██▌ ▗▟█▛▘   ▄▄▄▄▄▄▄▄▄▄▄▄▖   ▜█▙ ▟█▛
██▙▟██▘     ▝ ▐██   ██▌      ▜███▀
██▛▀▀██▖      ▐██   ██▌     ▗▟█▜█▙
██▌  ▝▜█▙     ▐█▛   ██▌    ▗██▘ ▀██▖
██▌    ▀██▄   ██▌   ▜██▟  ▄█▛▘   ▝██▖"""

    # 8 lines
    S8 = """\
███▌     ▄███▀                     ▝▜██▄     ▟██▛
███▌   ▄███▀                         ▜██▙   ▟██▛
███▌ ▄███▀      ▐████████████████▘    ▝██▙▄███▘
███▙████▖          ▐███    ███         ▝█████▘
████▛▀███▄         ▐███    ███         ▄█████▄
███▌   ▜██▙▖       ▐██▌    ███        ▟██▀ ▜██▙
███▌    ▝███▙      ▟██▌    ███▖     ▗███▘   ▀███▖
███▌      ▜███▖   ▗███     ▀████▌  ▄██▛▘     ▝███▖"""

    S8_LABS = """\
███▌     ▄███▀                     ▝▜██▄     ▟██▛
███▌   ▄███▀         KπX-Labs        ▜██▙   ▟██▛
███▌ ▄███▀      ▐████████████████▘    ▝██▙▄███▘
███▙████▖          ▐███    ███         ▝█████▘
████▛▀███▄         ▐███    ███         ▄█████▄
███▌   ▜██▙▖       ▐██▌    ███        ▟██▀ ▜██▙
███▌    ▝███▙      ▟██▌    ███▖     ▗███▘   ▀███▖
███▌      ▜███▖   ▗███     ▀████▌  ▄██▛▘     ▝███▖"""

    # 10 lines
    S10 = """\
████       ▗▟███▛▘                          ▜███▙       ▟███▛
████     ▗▟███▛▘                             ▝███▙▖    ▟███▀
████   ▗▟███▛▘      ▗▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▖     ▜███▖ ▗████▘
████  ▄███▛▘        ▐█▀▀▜███▛▀▀▀▀▜███▛▀▀▀▘      ▀███▄███▛
████▄█████▖             ▐███▌    ▐███▌           ▝█████▛
██████▀████▄            ▐███▌    ▐███▌           ▟██████▖
████▘   ▜███▙▖          ▟███     ▐███▌         ▗███▛▘▜███▄
████     ▝▜███▙         ████     ▐███▌        ▄███▛   ▀███▙
████       ▀████▖      ▗███▛     ▐███▙▖▄     ▟███▀     ▝████▖
████        ▝▜███▙▖    ▟███☖      ▜█████▌  ▗████▘       ▝▜███▖"""

    S10_LABS = """\
████       ▗▟███▛▘                          ▜███▙       ▟███▛
████     ▗▟███▛▘           KπX-Labs          ▝███▙▖    ▟███▀
████   ▗▟███▛▘      ▗▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▖     ▜███▖ ▗████▘
████  ▄███▛▘        ▐█▀▀▜███▛▀▀▀▀▜███▛▀▀▀▘      ▀███▄███▛
████▄█████▖             ▐███▌    ▐███▌           ▝█████▛
██████▀████▄            ▐███▌    ▐███▌           ▟██████▖
████▘   ▜███▙▖          ▟███     ▐███▌         ▗███▛▘▜███▄
████     ▝▜███▙         ████     ▐███▌        ▄███▛   ▀███▙
████       ▀████▖      ▗███▛     ▐███▙▖▄     ▟███▀     ▝████▖
████        ▝▜███▙▖    ▟███☖      ▜█████▌  ▗████▘       ▝▜███▖"""

    # 12 lines
    S12 = """\
█████         ▗▟████▛▘                               ▝████▙         ▟████▛
█████       ▗▟████▛▘                                  ▝▜████▖      ▟████▘
█████     ▗▟████▀▘                                      ▜████▖   ▗████▛▘
█████   ▗▟████▀          █████████████████████████       ▝████▙ ▄████▛
█████ ▗▟████▀            ▀▀▀▀▜████▀▀▀▀▀▀▜████▀▀▀▀▀        ▝▜████████▀
█████▟██████▖                ▐████      ▐████               ▜██████▘
███████▛▜████▙               ▐████      ▐████              ▄███████▙▖
█████▀   ▀█████▄             ▐████      ▐████             ▟████▀▜████▖
█████      ▜████▙▖           ▟████      ▐████           ▗████▛▘  ▜████▄
█████       ▝█████▄          ████▛      ▐████▖         ▄████▛     ▀████▙
█████         ▀█████▖       ▐████▌      ▝████▙▄▄▄     ▟████▀       ▝████▙▖
█████          ▝▜████▙▖     █████        ▀███████   ▗█████▘         ▝▜████▖"""

    S12_LABS = """\
█████         ▗▟████▛▘                               ▝████▙         ▟████▛
█████       ▗▟████▛▘                                  ▝▜████▖      ▟████▘
█████     ▗▟████▀▘               KπX-Labs               ▜████▖   ▗████▛▘
█████   ▗▟████▀          █████████████████████████       ▝████▙ ▄████▛
█████ ▗▟████▀            ▀▀▀▀▜████▀▀▀▀▀▀▜████▀▀▀▀▀        ▝▜████████▀
█████▟██████▖                ▐████      ▐████               ▜██████▘
███████▛▜████▙               ▐████      ▐████              ▄███████▙▖
█████▀   ▀█████▄             ▐████      ▐████             ▟████▀▜████▖
█████      ▜████▙▖           ▟████      ▐████           ▗████▛▘  ▜████▄
█████       ▝█████▄          ████▛      ▐████▖         ▄████▛     ▀████▙
█████         ▀█████▖       ▐████▌      ▝████▙▄▄▄     ▟████▀       ▝████▙▖
█████          ▝▜████▙▖     █████        ▀███████   ▗█████▘         ▝▜████▖"""

    # 16 lines
    S16 = """\
███████             ▟██████▛▘                                          ▜██████▖            ▟██████▘
███████           ▟██████▛▘                                             ▝██████▙         ▗▟██████▘
███████        ▗▄██████▛▘                                                ▝▜█████▙       ▗██████▛
███████       ▄██████▛▘             ▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▖        ▜██████▖    ▄██████▀
███████     ▄██████▛▘            █████████████████████████████████▌         ▝██████▖  ▟██████▘
███████   ▄██████▛▘              █████████████████████████████████▌          ▝▜█████▙▟█████▛▘
███████ ▄██████▛▘                      ▐█████▌        ██████▌                  ▜██████████▛
████████████████▄                      ▐█████▌        ██████▌                   ▐████████▌
██████████▛███████▖                    ▐█████▌        ██████▌                  ▄██████████▄
████████▀  ▝▜██████▙                   ▐█████▌        ██████▌                 ▟█████▛██████▙
███████      ▝███████▄                 ██████▌        ██████▌               ▗██████▛ ▝▜█████▙▖
███████        ▜██████▙▖               ██████▘        ██████▌              ▗██████▀    ▜██████▖
███████         ▝███████▄             ▐██████         ██████▌             ▟██████▘      ▀██████▄
███████           ▀███████▖           ▟█████▛         ██████▙           ▗▟█████▛         ▝██████▙
███████            ▝▜██████▙         ▗██████▌         ▐██████████      ▗██████▛           ▝▜██████▖
███████              ▀███████▄       ▐██████           ▝▜████████▖    ▟██████▘              ▜██████▖"""

    S16_LABS = """\
███████             ▟██████▛▘                                          ▜██████▖            ▟██████▘
███████           ▟██████▛▘                                             ▝██████▙         ▗▟██████▘
███████        ▗▄██████▛▘                     KπX-Labs                   ▝▜█████▙       ▗██████▛
███████       ▄██████▛▘             ▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▖        ▜██████▖    ▄██████▀
███████     ▄██████▛▘            █████████████████████████████████▌         ▝██████▖  ▟██████▘
███████   ▄██████▛▘              █████████████████████████████████▌          ▝▜█████▙▟█████▛▘
███████ ▄██████▛▘                      ▐█████▌        ██████▌                  ▜██████████▛
████████████████▄                      ▐█████▌        ██████▌                   ▐████████▌
██████████▛███████▖                    ▐█████▌        ██████▌                  ▄██████████▄
████████▀  ▝▜██████▙                   ▐█████▌        ██████▌                 ▟█████▛██████▙
███████      ▝███████▄                 ██████▌        ██████▌               ▗██████▛ ▝▜█████▙▖
███████        ▜██████▙▖               ██████▘        ██████▌              ▗██████▀    ▜██████▖
███████         ▝███████▄             ▐██████         ██████▌             ▟██████▘      ▀██████▄
███████           ▀███████▖           ▟█████▛         ██████▙           ▗▟█████▛         ▝██████▙
███████            ▝▜██████▙         ▗██████▌         ▐██████████      ▗██████▛           ▝▜██████▖
███████              ▀███████▄       ▐██████           ▝▜████████▖    ▟██████▘              ▜██████▖"""


class KπX_COMPACT(str, Enum):
    """KπX COMPACT family in condensed Unicode block elements."""

    # 6 lines
    S6 = """\
██▌ ▗▟█▀           ▝██  ▟█▛
██▌▄█▛▘ ▗▄▄▄▄▄▄▄▄▖  ▝█▙▟█▛
█████   ▝▘██▌ ██▌    ▐███
██▛▜█▙    ██▌ ██▌    ▟███▖
██▌ ▜█▙   ██  ██▌   ▟█▛▝██▖
██▌  ▜█▙ ▗██  ▜██▖ ▟█▛  ▝██"""

    S6_LABS = """\
██▌ ▗▟█▀  KπX-Labs ▝██  ▟█▛
██▌▄█▛▘ ▗▄▄▄▄▄▄▄▄▖  ▝█▙▟█▛
█████   ▝▘██▌ ██▌    ▐███
██▛▜█▙    ██▌ ██▌    ▟███▖
██▌ ▜█▙   ██  ██▌   ▟█▛▝██▖
██▌  ▜█▙ ▗██  ▜██▖ ▟█▛  ▝██"""

    # 8 lines
    S8 = """\
███   ▗███▘              ███   ▗██▛
███  ▄██▛                ▝██▙ ▗██▛
███▗▟██▘   ███████████▌   ▝██▙██▛
██████▖      ███  ███      ▝████
███▛▜██▖     ██▛  ███      ▐████▖
███  ▜██▖    ██▌  ███     ▗██▛▜██▖
███   ▜██▙  ▗██▌  ███    ▗██▛  ▜██▖
███    ▜██▌ ▐██▘  ▝███▌ ▗██▛    ███"""

    S8_LABS = """\
███   ▗███▘              ███   ▗██▛
███  ▄██▛    KπX-Labs    ▝██▙ ▗██▛
███▗▟██▘   ███████████▌   ▝██▙██▛
██████▖      ███  ███      ▝████
███▛▜██▖     ██▛  ███      ▐████▖
███  ▜██▖    ██▌  ███     ▗██▛▜██▖
███   ▜██▙  ▗██▌  ███    ▗██▛  ▜██▖
███    ▜██▌ ▐██▘  ▝███▌ ▗██▛    ███"""

    # 10 lines
    S10 = """\
███▌    ▗███▛                 ▜███     ███▛
███▌   ▟███▘                   ▜██▙   ▟██▛
███▌ ▗▟██▛   ▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄    ▜██▙ ▟██▛
███▌▄███▘    █▛▀███▛▀▀▜███▀▀     ▜█████▛
███████▙        ███   ▐███        ▜████
████▛███▙       ███   ▐███       ▗█████▖
███▌ ▝▜██▙      ███   ▐███      ▗███▀███▖
███▌   ▜███▖   ▐███   ▐███     ▗███▘ ▝███▖
███▌    ▜███▖  ▐███   ▐███▄▖  ▗███▌   ▐███▖
███▌     ▜███▖ ███▌    ▜████ ▗███▛     ▜███"""

    S10_LABS = """\
███▌    ▗███▛                 ▜███     ███▛
███▌   ▟███▘     KπX-Labs      ▜██▙   ▟██▛
███▌ ▗▟██▛   ▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄    ▜██▙ ▟██▛
███▌▄███▘    █▛▀███▛▀▀▜███▀▀     ▜█████▛
███████▙        ███   ▐███        ▜████
████▛███▙       ███   ▐███       ▗█████▖
███▌ ▝▜██▙      ███   ▐███      ▗███▀███▖
███▌   ▜███▖   ▐███   ▐███     ▗███▘ ▝███▖
███▌    ▜███▖  ▐███   ▐███▄▖  ▗███▌   ▐███▖
███▌     ▜███▖ ███▌    ▜████ ▗███▛     ▜███"""

    # 12 lines
    S12 = """\
████      ▗████▘                   ▝████      ▟███▌
████     ▟███▛                      ▝███▙    ▟███▛
████   ▗████▀                        ▝███▙  ▟███▛
████  ▟███▛▘   ▐█████████████████▌    ▝███▙▗███▛
████▗▟███▀     ▝▀▀▀███▛▀▀▀▜███▛▀▀▘     ▝██████▛
█████████▖         ███▌   ▐███▌         ▐█████
█████▛████▖        ███▌   ▐███▌        ▗██████▌
████▀ ▝████▄       ███▌   ▐███▌        ████▜███▖
████   ▝▜███▙     ▐███▌   ▐███▌       ▟███▘ ▜███▖
████     ▜███▙    ▐███▌   ▐███▌      ▟███▘  ▝████▖
████      ▜███▙   ████    ▝████▄▄   ▟███▘    ▝████▖
████       ▜████  ███▛     ▀█████  ▟███▌      ▝████"""

    S12_LABS = """\
████      ▗████▘                   ▝████      ▟███▌
████     ▟███▛                      ▝███▙    ▟███▛
████   ▗████▀       KπX-Labs         ▝███▙  ▟███▛
████  ▟███▛▘   ▐█████████████████▌    ▝███▙▗███▛
████▗▟███▀     ▝▀▀▀███▛▀▀▀▜███▛▀▀▘     ▝██████▛
█████████▖         ███▌   ▐███▌         ▐█████
█████▛████▖        ███▌   ▐███▌        ▗██████▌
████▀ ▝████▄       ███▌   ▐███▌        ████▜███▖
████   ▝▜███▙     ▐███▌   ▐███▌       ▟███▘ ▜███▖
████     ▜███▙    ▐███▌   ▐███▌      ▟███▘  ▝████▖
████      ▜███▙   ████    ▝████▄▄   ▟███▘    ▝████▖
████       ▜████  ███▛     ▀█████  ▟███▌      ▝████"""

    # 16 lines
    S16 = """\
█████▌        ▄█████▀                          ▜█████        ▗█████▘
█████▌      ▗▟█████▘                            ▜████▙      ▗█████▘
█████▌     ▗█████▛                               ▜████▙     █████▌
█████▌    ▟█████▘     ▗▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▖     ▜████▙   ▟████▛
█████▌  ▗█████▛     ▐███████████████████████▌      ▜████▙ ▟████▛
█████▌ ▟█████▘      ▐███████████████████████▌       ▜█████████▛
█████▙▟████▛             ▐████     ▐████▌            ▜███████▛
████████████▖            ▟████     ▐████▌             ███████
█████████████▄           █████     ▐████▌            ▟███████▙
██████▀ ▝█████▙          █████     ▐████▌           ▟█████████▙
█████▌   ▝█████▙         █████     ▐████▌          ▐████▛▝█████▌
█████▌    ▝█████▙        █████     ▐████▌         ▗████▛  ▝█████▖
█████▌     ▝▜█████▖     ▐████▛     ▐████▌        ▗█████▘   ▝█████▖
█████▌       ▜█████▖    ▐████▌     ▐█████▖      ▗█████▘     ▝█████▖
█████▌        ▜█████▖   █████▘      ████████   ▗█████▘       ▝█████▖
█████▌         ▜█████▖ ▗█████       ▝▜██████▖ ▗█████▘         ▜█████"""

    S16_LABS = """\
█████▌        ▄█████▀                          ▜█████        ▗█████▘
█████▌      ▗▟█████▘                            ▜████▙      ▗█████▘
█████▌     ▗█████▛           KπX-Labs            ▜████▙     █████▌
█████▌    ▟█████▘     ▗▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▖     ▜████▙   ▟████▛
█████▌  ▗█████▛     ▐███████████████████████▌      ▜████▙ ▟████▛
█████▌ ▟█████▘      ▐███████████████████████▌       ▜█████████▛
█████▙▟████▛             ▐████     ▐████▌            ▜███████▛
████████████▖            ▟████     ▐████▌             ███████
█████████████▄           █████     ▐████▌            ▟███████▙
██████▀ ▝█████▙          █████     ▐████▌           ▟█████████▙
█████▌   ▝█████▙         █████     ▐████▌          ▐████▛▝█████▌
█████▌    ▝█████▙        █████     ▐████▌         ▗████▛  ▝█████▖
█████▌     ▝▜█████▖     ▐████▛     ▐████▌        ▗█████▘   ▝█████▖
█████▌       ▜█████▖    ▐████▌     ▐█████▖      ▗█████▘     ▝█████▖
█████▌        ▜█████▖   █████▘      ████████   ▗█████▘       ▝█████▖
█████▌         ▜█████▖ ▗█████       ▝▜██████▖ ▗█████▘         ▜█████"""


class KπX_π_BOLD(str, Enum):
    """KπX BOLD family drawn with the 'π' glyph."""

    # 6 lines
    S6 = """\
ππ     πππ                 ππ    πππ
ππ   πππ     πππππππππππ    πππ πππ
ππππππ        πππ   ππ       ππππ
πππ πππ        ππ   ππ       πππππ
ππ    πππ     πππ   ππ      ππ  πππ
ππ     πππ    ππ    ππππ  πππ     ππ"""

    S6_LABS = """\
ππ     πππ     KπX-Labs    ππ    πππ
ππ   πππ     πππππππππππ    πππ πππ
ππππππ        πππ   ππ       ππππ
πππ πππ        ππ   ππ       πππππ
ππ    πππ     πππ   ππ      ππ  πππ
ππ     πππ    ππ    ππππ  πππ     ππ"""

    # 8 lines
    S8 = """\
πππ       ππππ                      πππ      ππππ
πππ     πππ                          ππππ   ππππ
πππ   πππ        ππππππππππππππππ      πππ πππ
ππππππππ            πππ    πππ          πππππ
πππππ πππ           πππ    πππ         πππππππ
πππ    ππππ         πππ    πππ        ππππ ππππ
πππ      ππππ      πππ     πππ       πππ     πππ
πππ       ππππ     πππ      πππππ  ππππ       πππ"""

    S8_LABS = """\
πππ       ππππ                      πππ      ππππ
πππ     πππ          KπX-Labs        ππππ   ππππ
πππ   πππ        ππππππππππππππππ      πππ πππ
ππππππππ            πππ    πππ          πππππ
πππππ πππ           πππ    πππ         πππππππ
πππ    ππππ         πππ    πππ        ππππ ππππ
πππ      ππππ      πππ     πππ       πππ     πππ
πππ       ππππ     πππ      πππππ  ππππ       πππ"""

    # 10 lines
    S10 = """\
ππππ        πππππ                           πππππ       πππππ
ππππ      πππππ                               ππππ     ππππ
ππππ    πππππ        ππππππππππππππππππππ      ππππ   ππππ
ππππ  πππππ          ππππππππππππππππππππ       πππππππππ
ππππππππππ              ππππ     ππππ             ππππππ
ππππππππππππ            ππππ     ππππ            πππππππ
ππππ    πππππ           ππππ     ππππ           ππππ πππππ
ππππ      πππππ         ππππ     ππππ         πππππ   πππππ
ππππ       πππππ        ππππ      ππππ       ππππ       ππππ
ππππ         πππππ     ππππ       ππππππ    ππππ         ππππ"""

    S10_LABS = """\
ππππ        πππππ                           πππππ       πππππ
ππππ      πππππ            KπX-Labs           ππππ     ππππ
ππππ    πππππ        ππππππππππππππππππππ      ππππ   ππππ
ππππ  πππππ          ππππππππππππππππππππ       πππππππππ
ππππππππππ              ππππ     ππππ             ππππππ
ππππππππππππ            ππππ     ππππ            πππππππ
ππππ    πππππ           ππππ     ππππ           ππππ πππππ
ππππ      πππππ         ππππ     ππππ         πππππ   πππππ
ππππ       πππππ        ππππ      ππππ       ππππ       ππππ
ππππ         πππππ     ππππ       ππππππ    ππππ         ππππ"""

    # 12 lines
    S12 = """\
πππππ          ππππππ                                 πππππ         ππππππ
πππππ        ππππππ                                    πππππ       πππππ
πππππ      ππππππ                                       πππππ     πππππ
πππππ    ππππππ          πππππππππππππππππππππππππ        πππππ  πππππ
πππππ  ππππππ            π   ππππππ     ππππππ             πππππππππ
ππππππππππππ                  ππππ      πππππ               πππππππ
ππππππππππππππ                ππππ      πππππ               ππππππππ
πππππ     πππππ              πππππ      πππππ             πππππ πππππ
πππππ      ππππππ            πππππ      πππππ            πππππ   ππππππ
πππππ        ππππππ          πππππ      πππππ           πππππ     ππππππ
πππππ         ππππππ         ππππ        πππππππ      πππππ         πππππ
πππππ           ππππππ      πππππ         πππππππ    πππππ           πππππ"""

    S12_LABS = """\
πππππ          ππππππ                                 πππππ         ππππππ
πππππ        ππππππ                                    πππππ       πππππ
πππππ      ππππππ                KπX-Labs               πππππ     πππππ
πππππ    ππππππ          πππππππππππππππππππππππππ        πππππ  πππππ
πππππ  ππππππ            π   ππππππ     ππππππ             πππππππππ
ππππππππππππ                  ππππ      πππππ               πππππππ
ππππππππππππππ                ππππ      πππππ               ππππππππ
πππππ     πππππ              πππππ      πππππ             πππππ πππππ
πππππ      ππππππ            πππππ      πππππ            πππππ   ππππππ
πππππ        ππππππ          πππππ      πππππ           πππππ     ππππππ
πππππ         ππππππ         ππππ        πππππππ      πππππ         πππππ
πππππ           ππππππ      πππππ         πππππππ    πππππ           πππππ"""

    # 16 lines
    S16 = """\
πππππππ             ππππππππ                                           πππππππ             πππππππ
πππππππ           ππππππππ                                               πππππππ          πππππππ
πππππππ         ππππππππ                                                  πππππππ        πππππππ
πππππππ       ππππππππ                                                     πππππππ      πππππππ
πππππππ     ππππππππ             ππππππππππππππππππππππππππππππππππ          ππππππ   πππππππ
πππππππ   ππππππππ               πππππππππππππππππππππππππππππππππ            ππππππππππππππ
πππππππ ππππππππ                       πππππππ        ππππππ                   ππππππππππππ
πππππππππππππππππ                      πππππππ        ππππππ                    ππππππππππ
ππππππππππππππππππ                     πππππππ        ππππππ                    ππππππππππ
πππππππππ   ππππππππ                   πππππππ        ππππππ                  ππππππππππππππ
πππππππ       πππππππ                  ππππππ         ππππππ                 πππππππ  πππππππ
πππππππ        ππππππππ                ππππππ         ππππππ                ππππππ     πππππππ
πππππππ          ππππππππ              ππππππ         ππππππ              πππππππ       ππππππππ
πππππππ           ππππππππ            πππππππ         πππππππ            πππππππ          πππππππ
πππππππ             ππππππππ          ππππππ          πππππππππππ       πππππππ            πππππππ
πππππππ              ππππππππ        πππππππ            πππππππππ     πππππππ               πππππππ"""

    S16_LABS = """\
πππππππ             ππππππππ                                           πππππππ             πππππππ
πππππππ           ππππππππ                                               πππππππ          πππππππ
πππππππ         ππππππππ                                                  ππππππ        πππππππ
πππππππ       ππππππππ                        KπX-Labs                     πππππππ      πππππππ
πππππππ     ππππππππ             ππππππππππππππππππππππππππππππππππ          ππππππ   πππππππ
πππππππ   ππππππππ               πππππππππππππππππππππππππππππππππ            ππππππππππππππ
πππππππ ππππππππ                       πππππππ        ππππππ                   ππππππππππππ
πππππππππππππππππ                      πππππππ        ππππππ                    ππππππππππ
ππππππππππππππππππ                     πππππππ        ππππππ                    ππππππππππ
πππππππππ   ππππππππ                   πππππππ        ππππππ                  ππππππππππππππ
πππππππ       πππππππ                  ππππππ         ππππππ                 πππππππ  πππππππ
πππππππ        ππππππππ                ππππππ         ππππππ                ππππππ     πππππππ
πππππππ          ππππππππ              ππππππ         ππππππ              πππππππ       ππππππππ
πππππππ           ππππππππ            πππππππ         πππππππ            πππππππ          πππππππ
πππππππ             ππππππππ          ππππππ          πππππππππππ       πππππππ            πππππππ
πππππππ              ππππππππ        πππππππ            πππππππππ     πππππππ               πππππππ"""


class KπX_π_COMPACT(str, Enum):
    """KπX COMPACT family rendered using the 'π' character."""

    # 6 lines
    S6 = """\
ππ   πππ            ππ  πππ
ππ  ππ   ππππππππ    πππππ
πππππ     ππ  ππ      πππ
ππππππ    ππ  ππ     ππππ
ππ  πππ   ππ  ππ    πππ ππ
ππ   πππ  ππ  πππ  πππ   ππ"""

    S6_LABS = """\
ππ   πππ  KπX-Labs  ππ  πππ
ππ  ππ   ππππππππ    πππππ
πππππ     ππ  ππ      πππ
ππππππ    ππ  ππ     ππππ
ππ  πππ   ππ  ππ    πππ ππ
ππ   πππ  ππ  πππ  πππ   ππ"""

    # 8 lines (Default sovereign choice requested by KπX)
    S8 = """\
πππ    πππ               πππ    πππ
πππ  ππππ                 πππ  πππ
πππ πππ    ππππππππππππ    ππππππ
ππππππ       πππ  πππ       ππππ
πππππππ      πππ  πππ      πππππ
πππ  πππ     πππ  πππ      ππππππ
πππ   ππππ   πππ  πππ     πππ  πππ
πππ    ππππ πππ    ππππ  πππ    πππ"""

    S8_LABS = """\
πππ    πππ               πππ    πππ
πππ  ππππ    KπX-Labs     πππ  πππ
πππ πππ    ππππππππππππ    ππππππ
ππππππ       πππ  πππ       ππππ
πππππππ      πππ  πππ      πππππ
πππ  πππ     πππ  πππ      ππππππ
πππ   ππππ   πππ  πππ     πππ  πππ
πππ    ππππ πππ    ππππ  πππ    πππ"""

    # 10 lines
    S10 = """\
πππ      ππππ                 ππππ     ππππ
πππ    ππππ                    ππππ   ππππ
πππ   ππππ    ππππππππππππππ    ππππ ππππ
ππππππππ     πππππππππππππππ     πππππππ
ππππππππ        πππ   ππππ        πππππ
πππππππππ       πππ   ππππ        πππππ
ππππ  ππππ      πππ   ππππ       πππππππ
πππ    ππππ     πππ   ππππ      πππ   πππ
πππ     ππππ   ππππ    πππ     πππ    ππππ
πππ      ππππ  ππππ    πππππ  ππππ     ππππ"""

    S10_LABS = """\
πππ      ππππ                 ππππ     ππππ
πππ    ππππ      KπX-Labs      ππππ   ππππ
πππ   ππππ    ππππππππππππππ    ππππ ππππ
ππππππππ     πππππππππππππππ     πππππππ
ππππππππ        πππ   ππππ        πππππ
πππππππππ       πππ   ππππ        πππππ
ππππ  ππππ      πππ   ππππ       πππππππ
πππ    ππππ     πππ   ππππ      πππ   πππ
πππ     ππππ   ππππ    πππ     πππ    ππππ
πππ      ππππ  ππππ    πππππ  ππππ     ππππ"""

    # 12 lines
    S12 = """\
ππππ       ππππ                     ππππ      πππππ
ππππ     πππππ                       ππππ    πππππ
ππππ    ππππ                          ππππ  πππππ
ππππ  πππππ    ππππππππππππππππππ      ππππ ππππ
ππππ πππππ      π  ππππ   πππππ         πππππππ
πππππππππ          ππππ    ππππ         ππππππ
ππππππππππ         ππππ    ππππ         ππππππ
ππππ   ππππ        ππππ    ππππ        ππππππππ
ππππ    πππππ      ππππ    ππππ       ππππ  ππππ
ππππ     πππππ    ππππ     ππππ      ππππ    ππππ
ππππ      πππππ   ππππ     ππππππ   ππππ      ππππ
ππππ       πππππ  ππππ      πππππ  ππππ        ππππ"""

    S12_LABS = """\
ππππ       ππππ                     ππππ      πππππ
ππππ     πππππ                       ππππ    πππππ
ππππ    ππππ         KπX-Labs         ππππ  πππππ
ππππ  πππππ    ππππππππππππππππππ      ππππ ππππ
ππππ πππππ      π  ππππ   πππππ         πππππππ
πππππππππ          ππππ    ππππ         ππππππ
ππππππππππ         ππππ    ππππ         ππππππ
ππππ   ππππ        ππππ    ππππ        ππππππππ
ππππ    πππππ      ππππ    ππππ       ππππ  ππππ
ππππ     πππππ    ππππ     ππππ      ππππ    ππππ
ππππ      πππππ   ππππ     ππππππ   ππππ      ππππ
ππππ       πππππ  ππππ      πππππ  ππππ        ππππ"""

    # 16 lines
    S16 = """\
πππππ         πππππππ                          ππππππ         πππππ
πππππ        ππππππ                             ππππππ       πππππ
πππππ       ππππππ                               ππππππ     ππππππ
πππππ     ππππππ                                  ππππππ   ππππππ
πππππ    ππππππ      ππππππππππππππππππππππππ      ππππππ ππππππ
πππππ  ππππππ        ππππππππππππππππππππππππ       πππππππππππ
ππππππππππππ             πππππ      πππππ            πππππππππ
ππππππππππππ             πππππ      πππππ             πππππππ
πππππππππππππ            πππππ      πππππ            πππππππππ
πππππππ  ππππππ          πππππ      πππππ           πππππππππππ
πππππ     ππππππ         πππππ      πππππ          ππππππ πππππ
πππππ      ππππππ        πππππ      πππππ          πππππ   πππππ
πππππ       ππππππ       πππππ      πππππ         πππππ     πππππ
πππππ        ππππππ     ππππππ      πππππ        πππππ       πππππ
πππππ         ππππππ    πππππ       ππππππππ    πππππ         πππππ
πππππ          ππππππ   πππππ        πππππππ   πππππ          ππππππ"""

    S16_LABS = """\
πππππ         πππππππ                          ππππππ         πππππ
πππππ        ππππππ                             ππππππ       πππππ
πππππ       ππππππ                               ππππππ     ππππππ
πππππ     ππππππ             KπX-Labs             ππππππ   ππππππ
πππππ    ππππππ      ππππππππππππππππππππππππ      ππππππ ππππππ
πππππ  ππππππ        ππππππππππππππππππππππππ       πππππππππππ
ππππππππππππ             πππππ      πππππ            πππππππππ
ππππππππππππ             πππππ      πππππ             πππππππ
πππππππππππππ            πππππ      πππππ            πππππππππ
πππππππ  ππππππ          πππππ      πππππ           πππππππππππ
πππππ     ππππππ         πππππ      πππππ          ππππππ πππππ
πππππ      ππππππ        πππππ      πππππ          πππππ   πππππ
πππππ       ππππππ       πππππ      πππππ         πππππ     πππππ
πππππ        ππππππ     ππππππ      πππππ        πππππ       πππππ
πππππ         ππππππ    πππππ       ππππππππ    πππππ         πππππ
πππππ          ππππππ   πππππ        πππππππ   πππππ          ππππππ"""


class π_BLOCK(str, Enum):
    """Isolated central 'π' glyph in solid Unicode block elements."""

    S6 = """\
▄▄▄▄▄▄▄▄▄▄▄▄▖
  ▐██   ██▌   
  ▐██   ██▌  
  ▐█▛   ██▌  
  ██▌   ▜██▟ """

    S6_LABS = """\
  KπX-Labs   
▄▄▄▄▄▄▄▄▄▄▄▄▖ 
  ▐██   ██▌    
  ▐██   ██▌   
  ▐█▛   ██▌   
  ██▌   ▜██▟  """

    S8 = """\
 ▐████████████████▘
    ▐███    ███   
    ▐███    ███   
    ▐██▌    ███   
    ▟██▌    ███▖  
   ▗███     ▀████▌"""

    S8_LABS = """\
     KπX-Labs     
 ▐████████████████▘
    ▐███    ███   
    ▐███    ███   
    ▐██▌    ███   
    ▟██▌    ███▖  
   ▗███     ▀████▌"""

    S9 = """\
█████████████████████████
▀▀▀▀▜████▀▀▀▀▀▀▜████▀▀▀▀▀
    ▐████      ▐████
    ▐████      ▐████
    ▐████      ▐████
    ▟████      ▐████
    ████▛      ▐████▖
   ▐████▌      ▝████▙▄▄▄
   █████        ▀███████"""

    S9_LABS = """\
        KπX-Labs        
█████████████████████████
▀▀▀▀▜████▀▀▀▀▀▀▜████▀▀▀▀▀
    ▐████      ▐████
    ▐████      ▐████
    ▐████      ▐████
    ▟████      ▐████
    ████▛      ▐████▖
   ▐████▌      ▝████▙▄▄▄
   █████        ▀███████"""

    S12 = """\
 █████████████████████████      
 ▀▀▀▀▜████▀▀▀▀▀▀▜████▀▀▀▀▀      
     ▐████      ▐████           
     ▐████      ▐████           
     ▐████      ▐████           
     ▟████      ▐████           
     ████▛      ▐████▖          
    ▐████▌      ▝████▙▄▄▄       
    █████        ▀███████       
    █████         ██████▌       
    █████          ██████       """

    S12_LABS = """\
         KπX-Labs            
 █████████████████████████      
 ▀▀▀▀▜████▀▀▀▀▀▀▜████▀▀▀▀▀      
     ▐████      ▐████           
     ▐████      ▐████           
     ▐████      ▐████           
     ▟████      ▐████           
     ████▛      ▐████▖          
    ▐████▌      ▝████▙▄▄▄       
    █████        ▀███████       
    █████         ██████▌       
    █████          ██████       """

    S16 = """\
 ▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▖        
█████████████████████████████████▌      
█████████████████████████████████▌      
       ▐█████▌        ██████▌           
       ▐█████▌        ██████▌           
       ▐█████▌        ██████▌           
       ▐█████▌        ██████▌           
       ██████▌        ██████▌           
       ██████▘        ██████▌           
      ▐██████         ██████▌           
      ▟█████▛         ██████▙           
     ▗██████▌         ▐██████████       
     ▐██████           ▝▜████████▖      
     ██████▌             █████████      
     ██████               ████████      """

    S16_LABS = """\
             KπX-Labs                
 ▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▖        
█████████████████████████████████▌      
█████████████████████████████████▌      
       ▐█████▌        ██████▌           
       ▐█████▌        ██████▌           
       ▐█████▌        ██████▌           
       ▐█████▌        ██████▌           
       ██████▌        ██████▌           
       ██████▘        ██████▌           
      ▐██████         ██████▌           
      ▟█████▛         ██████▙           
     ▗██████▌         ▐██████████       
     ▐██████           ▝▜████████▖      
     ██████▌             █████████      
     ██████               ████████      """


class π_π(str, Enum):
    """Isolated central 'π' glyph rendered using the 'π' character."""

    S6 = """\
πππππππππππ  
 πππ   ππ    
  ππ   ππ    
 πππ   ππ    
 ππ    ππππ  """

    S6_LABS = """\
 KπX-Labs   
πππππππππππ   
 πππ   ππ     
  ππ   ππ     
 πππ   ππ     
 ππ    ππππ   """

    S8 = """\
 ππππππππππππππππ
    πππ    πππ   
    πππ    πππ   
    πππ    πππ   
   πππ     πππ   
   πππ      πππππ"""

    S8_LABS = """\
     KπX-Labs     
 ππππππππππππππππ 
    πππ    πππ    
    πππ    πππ    
    πππ    πππ    
   πππ     πππ    
   πππ      πππππ """

    S9 = """\
πππππππππππππππππππππππππ
π   ππππππ     ππππππ    
    ππππ      πππππ     
    ππππ      πππππ     
   πππππ      πππππ     
   πππππ      πππππ     
   πππππ      πππππ     
   ππππ        πππππππ  
  πππππ         πππππππ """

    S9_LABS = """\
        KπX-Labs        
πππππππππππππππππππππππππ
π   ππππππ     ππππππ    
    ππππ      πππππ     
    ππππ      πππππ     
   πππππ      πππππ     
   πππππ      πππππ     
   πππππ      πππππ     
   ππππ        πππππππ  
  πππππ         πππππππ """

    S12 = """\
 πππππππππππππππππππππππππ      
 π   ππππππ     ππππππ          
     ππππ      πππππ            
     ππππ      πππππ            
    πππππ      πππππ            
    πππππ      πππππ            
    πππππ      πππππ            
    ππππ        πππππππ         
   πππππ         πππππππ        
   πππππ          ππππππ        
   πππππ           πππππ        """

    S12_LABS = """\
        KπX-Labs            
 πππππππππππππππππππππππππ      
 π   ππππππ     ππππππ          
     ππππ      πππππ            
     ππππ      πππππ            
    πππππ      πππππ            
    πππππ      πππππ            
    πππππ      πππππ            
    ππππ        πππππππ         
   πππππ         πππππππ        
   πππππ          ππππππ        
   πππππ           πππππ        """

    S16 = """\
 ππππππππππππππππππππππππππππππππππ     
 ππππππππππππππππππππππππππππππππππ     
        πππππππ        ππππππ           
        πππππππ        ππππππ           
        πππππππ        ππππππ           
        πππππππ        ππππππ           
        ππππππ         ππππππ           
        ππππππ         ππππππ           
        ππππππ         ππππππ           
       πππππππ         πππππππ          
       ππππππ          πππππππππππ      
      ππππππ             πππππππππ      
      ππππππ               πππππππ      
      πππππ                 ππππππ      
      ππππ                   πππππ      """

    S16_LABS = """\
               KπX-Labs                
 ππππππππππππππππππππππππππππππππππ     
 ππππππππππππππππππππππππππππππππππ     
        πππππππ        ππππππ           
        πππππππ        ππππππ           
        πππππππ        ππππππ           
        πππππππ        ππππππ           
        ππππππ         ππππππ           
        ππππππ         ππππππ           
        ππππππ         ππππππ           
       πππππππ         πππππππ          
       ππππππ          πππππππππππ      
      ππππππ             πππππππππ      
      ππππππ               πππππππ      
      πππππ                 ππππππ      
      ππππ                   πππππ      """


class Logo(str, Enum):
    """Main selector for signature and default logo configurations."""

    KπX = KπX_π_COMPACT.S8.value
    KπX_Labs = KπX_π_COMPACT.S8_LABS.value

    π = π_π.S8.value
    π_Labs = π_π.S8_LABS.value
